# ModelPt2DToScreenPt

## Description
Transforms a point from world coordinate to the screen coordinates in plan rotation.

```pascal
PROCEDURE ModelPt2DToScreenPt(VAR pX,pY : REAL);
```

```python
def vs.ModelPt2DToScreenPt(p):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|   |

## Remarks
This routine transform  a given point from model(object) to VCS.

## Version
Availability: from VectorWorks13.0

## Category
* Objects - 2D